{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "special": true,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 1,
      "special": true,
      "content": "<|endoftext|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 2,
      "special": true,
      "content": "<|separator|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "NFD"
      },
      {
        "type": "Lowercase"
      },
      {
        "type": "StripAccents"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "WhitespaceSplit"
      }
    ]
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordPiece",
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 100,
    "vocab": {
      "[UNK]": 0,
      "<|endoftext|>": 1,
      "<|separator|>": 2,
      "-": 3,
      "/": 4,
      "0": 5,
      "1": 6,
      "2": 7,
      "3": 8,
      "4": 9,
      "5": 10,
      "6": 11,
      "7": 12,
      "8": 13,
      "9": 14,
      "=": 15,
      "a": 16,
      "b": 17,
      "c": 18,
      "d": 19,
      "e": 20,
      "f": 21,
      "g": 22,
      "h": 23,
      "i": 24,
      "j": 25,
      "k": 26,
      "l": 27,
      "m": 28,
      "n": 29,
      "o": 30,
      "p": 31,
      "q": 32,
      "r": 33,
      "s": 34,
      "t": 35,
      "u": 36,
      "v": 37,
      "w": 38,
      "x": 39,
      "y": 40,
      "z": 41,
      "##l": 42,
      "##z": 43,
      "##u": 44,
      "##j": 45,
      "##f": 46,
      "##q": 47,
      "##h": 48,
      "##w": 49,
      "##m": 50,
      "##k": 51,
      "##t": 52,
      "##i": 53,
      "##b": 54,
      "##y": 55,
      "##o": 56,
      "##x": 57,
      "##s": 58,
      "##n": 59,
      "##g": 60,
      "##r": 61,
      "##p": 62,
      "##a": 63,
      "##d": 64,
      "##v": 65,
      "##e": 66,
      "##c": 67,
      "##3": 68,
      "##0": 69,
      "##1": 70,
      "##=": 71,
      "##2": 72,
      "##7": 73,
      "##/": 74,
      "##8": 75,
      "##9": 76,
      "##4": 77,
      "##5": 78,
      "##6": 79
    }
  }
}